# Series using existing dataset /read_csv

In [57]:
import numpy as np
import pandas as pd

In [7]:
# with one col

In [29]:
series = pd.read_csv("subs.csv").iloc[:, 0]

In [33]:
df

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [35]:
type(df)

pandas.core.frame.DataFrame

In [39]:
df.head()

   Subscribers gained
0                  48
1                  57
2                  40
3                  43
4                  44

In [41]:
df.tail()

     Subscribers gained
360                 231
361                 226
362                 155
363                 144
364                 172

In [45]:
movies = pd.read_csv("bollywood.csv")

In [47]:
movies.value_counts()

movie                     lead
Andaaz                    Akshay Kumar        2
Tanu Weds Manu: Returns   Kangana Ranaut      2
Gabbar Is Back            Akshay Kumar        2
1920 (film)               Rajniesh Duggall    1
Newton (film)             Rajkummar Rao       1
                                             ..
Ghayal: Once Again        Sunny Deol          1
Ghanchakkar (film)        Vidya Balan         1
Ghajini (2008 film)       Aamir Khan          1
Genius (2018 Hindi film)  Utkarsh Sharma      1
Zor Lagaa Ke...Haiya!     Meghan Jadhav       1
Name: count, Length: 1497, dtype: int64

In [51]:
# sort values
vk = pd.read_csv("kohli_ipl.csv")

In [53]:
vk

     match_no  runs
0           1     1
1           2    23
2           3    13
3           4    12
4           5     1
..        ...   ...
210       211     0
211       212    20
212       213    73
213       214    25
214       215     7

[215 rows x 2 columns]

In [67]:
vk.sort_values(by="runs")

     match_no  runs
86         87     0
210       211     0
206       207     0
205       206     0
90         91     0
..        ...   ...
163       164   100
119       120   100
122       123   108
125       126   109
127       128   113

[215 rows x 2 columns]

vk.sort_values(by="runs",ascending=False)

In [77]:
vk

     match_no  runs
0           1     1
1           2    23
2           3    13
3           4    12
4           5     1
..        ...   ...
210       211     0
211       212    20
212       213    73
213       214    25
214       215     7

[215 rows x 2 columns]

# series maths method

In [86]:
# count;- totalno. of item sin series and non missing values

In [88]:
vk.count()

match_no    215
runs        215
dtype: int64

In [90]:
# sum

In [92]:
df.sum()

Subscribers gained    49510
dtype: int64

In [94]:
df.prod()

Subscribers gained    0
dtype: int64

In [96]:
# mean, median, mode, std,, var

In [102]:
df.mean()

Subscribers gained    135.643836
dtype: float64

In [104]:
vk.median()

match_no    108.0
runs         24.0
dtype: float64

In [106]:
df.mode()

   Subscribers gained
0                 105

In [112]:
movies.mode()

                     movie          lead
0                   Andaaz  Akshay Kumar
1           Gabbar Is Back           NaN
2  Tanu Weds Manu: Returns           NaN

In [114]:
df.std()

Subscribers gained    62.675023
dtype: float64

In [116]:
df.var()

Subscribers gained    3928.158513
dtype: float64

In [120]:
df.min()

Subscribers gained    33
dtype: int64

In [122]:
df.max()

Subscribers gained    396
dtype: int64

In [124]:
vk.describe()

         match_no        runs
count  215.000000  215.000000
mean   108.000000   30.855814
std     62.209324   26.229801
min      1.000000    0.000000
25%     54.500000    9.000000
50%    108.000000   24.000000
75%    161.500000   48.000000
max    215.000000  113.000000

In [126]:
vk.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   match_no  215 non-null    int64
 1   runs      215 non-null    int64
dtypes: int64(2)
memory usage: 3.5 KB

In [130]:
vk.isnull().head()

   match_no   runs
0     False  False
1     False  False
2     False  False
3     False  False
4     False  False